################################################# 1 вопрос
name = input("Введите своё имя: ")
age = input("Введите свой возраст: ")
print(f"Ваше имя: {name}, Ваш возраст: {age}")


################################################# 2 вопрос
number1 = int(input("Введите первое число: "))
number2 = int(input("Введите второе число: "))
print(f"Произведение обеих чисел: {number1 * number2}")


################################################# 3 вопрос
age_years = int(input("Введите год рождения: "))
print(f"Вам {2026 - age_years} лет(года)")


################################################# 4 вопрос
radius = float(input("Введите радиус круга: "))
print(f"Площадь круга: {3.14 * radius ** 2}")
print(f"Длина окружности: {2 * 3.14 * radius}")


################################################# 5 вопрос
chislo = float(input("Введите число с остатком: "))
print(f"Вот целое число: {int(chislo)}")

